too1/nrf52-ble-pong-central/app_pong.c
    }
    else if(m_gamestate.pong_pos_y < 0)
    {
        m_gamestate.pong_pos_y = 0;
        m_gamestate.ball_direction = 2.0f * PI - m_gamestate.ball_direction;
    } 
    
    // Update speed multiplier
    m_gamestate.time_since_last_speed_increment++;
    if(m_gamestate.time_since_last_speed_increment > (PONG_SPEED_INC_INTERVAL * GAME_LOOP_UPDATE_FREQ))
    {
        m_gamestate.time_since_last_speed_increment = 0;
        m_gamestate.ball_speed_inc_factor *= PONG_BALL_SPEED_INC_AMOUNT;
    }

    return next_state;
}

static void update_game_loop(void *p)
{
    // Update paddle positions based on game input, independent of state
    for(int i = 0; i < PONG_NUM_PLAYERS; i++)
    {
        m_gamestate.player[i].paddle_pos_y = m_global_control_state.player[i].paddle_x;
        m_gamestate.player[i].paddle_pos_y_delta = m_global_control_state.player[i].paddle_x_delta;
    }

    state_mngr_on_update(&m_gamestate_mngr);

    // Send event back
    m_pong_event.evt_type = PONG_EVENT_GAMESTATE_UPDATE;
    m_pong_event.game_state = &m_gamestate;
    m_event_callback(&m_pong_event);
}

void gs_waiting_for_players(state_mngr_t * context, state_ops_return_t * return_data)
{
    uint32_t blink_fast = (context->lifetime >> 3) % 2;
    uint32_t paddle1_color, paddle2_color;
    switch(context->current_op)
    {
        case STATE_OP_ENTER:
            start_every_state(context->current_state);
            break;

        case STATE_OP_DRAW:
            paddle1_color = (m_gamestate.player[0].connected_state == CONSTATE_DISCONNECTED) ? CL_RED : m_gamestate.player[0].color;
            if(m_gamestate.player[0].connected_state != CONSTATE_ACTIVE && blink_fast) paddle1_color = CL_BLACK;
            paddle2_color = (m_gamestate.player[1].connected_state == CONSTATE_DISCONNECTED) ? CL_RED : m_gamestate.player[1].color;
            if(m_gamestate.player[1].connected_state != CONSTATE_ACTIVE && blink_fast) paddle2_color = CL_BLACK;
            app_display_draw_paddles(16, 16, paddle1_color, paddle2_color, m_graphics_invalidate);
            app_display_draw_text("Waiting", 32, 2, CL_BLUE, ALIGNMENT_CENTRE);
            app_display_draw_text("for", 32, 11, CL_BLUE, ALIGNMENT_CENTRE);
            app_display_draw_text("players", 32, 20, CL_BLUE, ALIGNMENT_CENTRE);
            break;

        default:
            break;
    }
}

void gs_tournament_round_starting(state_mngr_t * context, state_ops_return_t * return_data)
{
    uint32_t blink_fast = (context->lifetime >> 3) % 2;
    switch(context->current_op)
    {
        case STATE_OP_ENTER:
            start_every_state(context->current_state);
            return_data->go_to_state = reset_game();
            //app_display_draw_text(m_gamestate.player[0].name, 1, 11, m_gamestate.player[0].color, ALIGNMENT_LEFT);
            app_display_draw_text("vs", 63, 12, CL_WHITE, ALIGNMENT_RIGHT);
            //app_display_draw_text(m_gamestate.player[1].name, 52,21, m_gamestate.player[1].color, ALIGNMENT_RIGHT);
            break;

        case STATE_OP_UPDATE:
            if(m_global_control_state.player[0].button_pressed && 
               m_global_control_state.player[1].button_pressed)
            {
                return_data->go_to_state = STATE_GAME_START_PREDELAY;
            }
            break;

        case STATE_OP_DRAW:
            app_display_text_view_draw(&m_textview_get_ready, false);
            app_display_text_view_set_offset(&m_textview_p1_name, ((context->lifetime / 5) % 8), 0);
            if(m_gamestate.player[0].connected_state == CONSTATE_ACTIVE || blink_fast) app_display_text_view_draw(&m_textview_p1_name, true);
            app_display_text_view_draw(&m_textview_versus, false);
            if(m_gamestate.player[1].connected_state == CONSTATE_ACTIVE || blink_fast) app_display_text_view_draw(&m_textview_p2_name, true);
            break;

        default:
            break;
    }
}

void gs_start_new_game(state_mngr_t * context, state_ops_return_t * return_data)
{
    switch(context->current_op)
    {
        case STATE_OP_ENTER:
            start_every_state(context->current_state);
            return_data->go_to_state = reset_game();
            break;

        case STATE_OP_UPDATE:
            return_data->go_to_state = STATE_GAME_START_PREDELAY;
            break;

        default:
            break;
    }
}

void gs_start_predelay(state_mngr_t * context, state_ops_return_t * return_data)
{
    switch(context->current_op)
    {
        case STATE_OP_ENTER:
            start_every_state(context->current_state);
            app_display_draw_square(4, 0, 56, 32, CL_BLACK);
            app_display_score_state(&m_gamestate);
            break;

        case STATE_OP_UPDATE:
            if(context->lifetime > (PONG_PREDELAY_TIME_S * GAME_LOOP_UPDATE_FREQ))
            {
                return_data->go_to_state = STATE_GAME_RUNNING;
            }
            break;

        case STATE_OP_DRAW:
            app_display_draw_text("Get ready", 32, 2, CL_WHITE, ALIGNMENT_CENTRE);
            app_display_draw_square(20, 12, 20, 20, CL_BLACK);
            app_display_draw_int(PONG_PREDELAY_TIME_S - (context->lifetime / GAME_LOOP_UPDATE_FREQ), 32, 14, CL_WHITE, ALIGNMENT_CENTRE);
            app_display_draw_paddles(m_gamestate.player[0].paddle_pos_y * 32 / LEVEL_SIZE_Y, m_gamestate.player[1].paddle_pos_y * 32 / LEVEL_SIZE_Y,
                                     m_gamestate.player[0].color, m_gamestate.player[1].color, m_graphics_invalidate);
            break;

        default:
            break;
    }
}

void gs_game_running(state_mngr_t * context, state_ops_return_t * return_data)
{
    switch(context->current_op)
    {
        case STATE_OP_ENTER:
            start_every_state(context->current_state);
            break;

        case STATE_OP_UPDATE:
            return_data->go_to_state = update_game_running();
            break;

        case STATE_OP_DRAW:
            app_display_draw_paddles(m_gamestate.player[0].paddle_pos_y * 32 / LEVEL_SIZE_Y, m_gamestate.player[1].paddle_pos_y * 32 / LEVEL_SIZE_Y,
                                     m_gamestate.player[0].color, m_gamestate.player[1].color, m_graphics_invalidate);
            app_display_score_state(&m_gamestate);
            app_display_draw_ball(m_gamestate.pong_pos_x * 58 / LEVEL_SIZE_X, m_gamestate.pong_pos_y * 30 / LEVEL_SIZE_Y);
            break;

        default:
            break;
    }
}

void gs_point_scored(state_mngr_t * context, state_ops_return_t * return_data)
{
    switch(context->current_op)
    {
        case STATE_OP_ENTER:
            start_every_state(context->current_state);
            m_point_won_game_state.paddle_pos_end[0] = m_gamestate.player[0].paddle_pos_y;
            m_point_won_game_state.paddle_pos_end[1] = m_gamestate.player[1].paddle_pos_y;
            break;

