too1/nrf52-ble-pong-central/app_pong.c
        case STATE_OP_UPDATE:
            if(context->lifetime > (PONG_POINT_SCORED_SHOW_TIME_S * GAME_LOOP_UPDATE_FREQ))
            {
                if(!m_point_won_game_state.game_over)
                {
                   return_data->go_to_state = STATE_GAME_START_PREDELAY;
                }
                else 
                {
                   return_data->go_to_state = STATE_GAME_SCORE_LIMIT_REACHED;
                }
            }
            break;

        case STATE_OP_DRAW:
            if(context->lifetime == 0)
            {
                app_display_draw_text("point to", 32, 2, CL_BLUE, ALIGNMENT_CENTRE);
                app_display_draw_text(m_gamestate.player[m_point_won_game_state.winning_player].name, 32, 8, 
                                      CL_WHITE, ALIGNMENT_CENTRE);
            }
            if((context->lifetime % 16) == 0)
            {
                app_display_draw_paddles(m_point_won_game_state.paddle_pos_end[0] * 32 / LEVEL_SIZE_Y, m_point_won_game_state.paddle_pos_end[1] * 32 / LEVEL_SIZE_Y,
                                     m_gamestate.player[0].color, m_gamestate.player[1].color, true);

                app_display_draw_ball(m_point_won_game_state.ball_x * 58 / LEVEL_SIZE_X, m_point_won_game_state.ball_y * 30 / LEVEL_SIZE_Y);
                app_display_score_state(&m_gamestate);
            }
            else if((context->lifetime % 16) == 8)
            {
                app_display_draw_square(0, 0, 6, 32, CL_BLACK);
                app_display_draw_square(58, 0, 6, 32, CL_BLACK);
                app_display_score_state(&m_gamestate);
            }
            break;

        default:
            break;
    }
}

void gs_score_limit_reached(state_mngr_t * context, state_ops_return_t * return_data)
{
    switch(context->current_op)
    {
        case STATE_OP_ENTER:
            start_every_state(context->current_state);
            app_display_draw_text("GAME OVER", 32, 2, CL_YELLOW, ALIGNMENT_CENTRE);
            app_display_score_state(&m_gamestate);
            break;

        case STATE_OP_UPDATE:
            // If both players press the button, start a new game
            if(m_global_control_state.player[0].button_pressed && m_global_control_state.player[1].button_pressed)
            {
                return_data->go_to_state = STATE_GAME_START_NEW_GAME;
            }
            break;

        default:
            break;
    }
}

// "Public" functions
uint32_t app_pong_init(pong_config_t *config)
{
    static state_ops_map_t state_ops_map[] = {{STATE_WAITING_FOR_PLAYERS, gs_waiting_for_players},
                                              {STATE_GAME_TOURNAMENT_ROUND_STARTING, gs_tournament_round_starting},
                                              {STATE_GAME_START_NEW_GAME, gs_start_new_game},
                                              {STATE_GAME_START_PREDELAY, gs_start_predelay},
                                              {STATE_GAME_RUNNING, gs_game_running},
                                              {STATE_GAME_POINT_SCORED, gs_point_scored},
                                              {STATE_GAME_SCORE_LIMIT_REACHED, gs_score_limit_reached}}; 
    
    if(config->event_handler == 0) return -1;
    m_event_callback = config->event_handler;
    m_game_initialized = true;
    
    state_mngr_init(&m_gamestate_mngr, state_ops_map, sizeof(state_ops_map)/sizeof(state_ops_map[0]));

    app_display_text_view_add(&m_textview_get_ready);
    app_display_text_view_add(&m_textview_p1_name);
    app_display_text_view_add(&m_textview_p2_name);
    app_display_text_view_add(&m_textview_versus);

    app_timer_create(&m_game_loop_timer_id, APP_TIMER_MODE_REPEATED, update_game_loop);
    reset_game();
    m_gamestate.player[0].connected_state = CONSTATE_DISCONNECTED;
    m_gamestate.player[1].connected_state = CONSTATE_DISCONNECTED;
    m_gamestate.player[0].color = COLOR_RGB(255, 0, 127);
    m_gamestate.player[1].color = COLOR_RGB(127, 255, 0);
    return 0;
}

uint32_t app_pong_start_game(void)
{
    if(!m_game_initialized) return -1;
    state_mngr_run_state(&m_gamestate_mngr, STATE_WAITING_FOR_PLAYERS);
    app_timer_start(m_game_loop_timer_id, APP_TIMER_TICKS(GAME_LOOP_UPDATE_MS), 0);
    return 0;
}

uint32_t app_pong_start_tournament_round(uint8_t *init_buffer, uint32_t init_buffer_length)
{
    static uint8_t player1_name_buf[17], player2_name_buf[17];
    int i;
    if(!m_game_initialized) return -1;
    if(!(m_gamestate_mngr.current_state == STATE_WAITING_FOR_PLAYERS || m_gamestate_mngr.current_state == STATE_GAME_SCORE_LIMIT_REACHED || m_gamestate_mngr.current_state == STATE_GAME_POINT_SCORED)) return -1;
    m_gamestate.player[0].color = (uint32_t)*init_buffer++ << 16 | 
                                  (uint32_t)*init_buffer++ << 8 | 
                                  (uint32_t)*init_buffer++;
    for(i = 0; i < 15; i++)
    {
        player1_name_buf[i] = *init_buffer;
        if(*init_buffer++ == 0) break;
    }
    player1_name_buf[i + 1] = 0;
    m_gamestate.player[0].name = player1_name_buf;
    on_set_thingy_color(0, m_gamestate.player[0].color);
    app_display_text_view_set_color(&m_textview_p1_name, m_gamestate.player[0].color);
    app_display_text_view_set_text(&m_textview_p1_name, m_gamestate.player[0].name);

    m_gamestate.player[1].color = (uint32_t)*init_buffer++ << 16 | 
                                  (uint32_t)*init_buffer++ << 8 | 
                                  (uint32_t)*init_buffer++;
    for(i = 0; i < 15; i++)
    {
        player2_name_buf[i] = *init_buffer;
        if(*init_buffer++ == 0) break;
    }
    player2_name_buf[i + 1] = 0;
    m_gamestate.player[1].name = player2_name_buf;
    on_set_thingy_color(1, m_gamestate.player[1].color);
    app_display_text_view_set_color(&m_textview_p2_name, m_gamestate.player[1].color);
    app_display_text_view_set_text(&m_textview_p2_name, m_gamestate.player[1].name);
    
    on_game_started();
    state_mngr_run_state(&m_gamestate_mngr, STATE_GAME_TOURNAMENT_ROUND_STARTING);
    return 0;
}

static void pong_start_dummy_tournament_round(void)
{
    m_gamestate.player[0].color = 0x0088FF;
    m_gamestate.player[0].name = "Bob";
    on_set_thingy_color(0, m_gamestate.player[0].color);
    app_display_text_view_set_color(&m_textview_p1_name, m_gamestate.player[0].color);
    app_display_text_view_set_text(&m_textview_p1_name, m_gamestate.player[0].name);
    m_gamestate.player[1].color = 0xFF8800;
    m_gamestate.player[1].name = "Alice";
    on_set_thingy_color(1, m_gamestate.player[1].color);
    app_display_text_view_set_color(&m_textview_p2_name, m_gamestate.player[1].color);
    app_display_text_view_set_text(&m_textview_p2_name, m_gamestate.player[1].name);
    state_mngr_run_state(&m_gamestate_mngr, STATE_GAME_TOURNAMENT_ROUND_STARTING);    
}

